In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'k1':[1,2,np.nan],'k2':[3,np.nan,np.nan],'k3':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

    k1   k2  k3
0  1.0  3.0   1
1  2.0  NaN   2
2  NaN  NaN   3

In [5]:
df.dropna()

    k1   k2  k3
0  1.0  3.0   1

In [6]:
df

    k1   k2  k3
0  1.0  3.0   1
1  2.0  NaN   2
2  NaN  NaN   3

In [7]:
df.dropna(axis=1)

   k3
0   1
1   2
2   3

In [8]:
df

    k1   k2  k3
0  1.0  3.0   1
1  2.0  NaN   2
2  NaN  NaN   3

In [9]:
df.dropna(thresh=2) # if have at least 2 non-na values don't drop

    k1   k2  k3
0  1.0  3.0   1
1  2.0  NaN   2

In [10]:
df.fillna(value="FILL")

     k1    k2  k3
0     1     3   1
1     2  FILL   2
2  FILL  FILL   3

In [12]:
df['k1'].fillna(value=df['k1'].mean())

0    1.0
1    2.0
2    1.5
Name: k1, dtype: float64

In [14]:
d = {'Company':['Goog','Mcrsft','fb','Goog','Mcrsft','fb'],'Person':['Amy','Bob','Mark','Said','Jamie','lily'],'Sales':[100,200,130,120,150,110]}

In [15]:
df = pd.DataFrame(d)

In [16]:
df

  Company Person  Sales
0    Goog    Amy    100
1  Mcrsft    Bob    200
2      fb   Mark    130
3    Goog   Said    120
4  Mcrsft  Jamie    150
5      fb   lily    110

In [17]:
 grouped_data = df.groupby('Company')

In [18]:
grouped_data

In [19]:
grouped_data.sum()

         Sales
Company
Goog       220
Mcrsft     350
fb         240

In [21]:
grouped_data.get_group(name='Goog')

  Person  Sales
0    Amy    100
3   Said    120

In [23]:
grouped_data.sum().loc['fb']

Sales    240
Name: fb, dtype: int64

In [24]:
df

  Company Person  Sales
0    Goog    Amy    100
1  Mcrsft    Bob    200
2      fb   Mark    130
3    Goog   Said    120
4  Mcrsft  Jamie    150
5      fb   lily    110

In [25]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
Goog      2.0  110.0  14.142136  100.0  105.0  110.0  115.0  120.0
Mcrsft    2.0  175.0  35.355339  150.0  162.5  175.0  187.5  200.0
fb        2.0  120.0  14.142136  110.0  115.0  120.0  125.0  130.0

In [31]:
df.groupby('Company').describe().loc['fb']

Sales  count      2.000000
       mean     120.000000
       std       14.142136
       min      110.000000
       25%      115.000000
       50%      120.000000
       75%      125.000000
       max      130.000000
Name: fb, dtype: float64